jibonaronno/documentsA/ACQ/tms320f28377s_v303 - ACQ Source Code/tms320f28377s_v303/common/deprecated/inc/hw_gpio.h
//###########################################################################
//
// FILE:    hw_gpio.h
//
// TITLE:   Definitions for the C28x GPIO registers.
//
//###########################################################################
// $TI Release: F2837xS Support Library v3.03.00.00 $
// $Release Date: Thu Dec  7 18:53:06 CST 2017 $
// $Copyright:
// Copyright (C) 2014-2017 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef __HW_GPIO_H__
#define __HW_GPIO_H__

//*****************************************************************************
//
// The following are defines for the GPIO register offsets
//
//*****************************************************************************
#define GPIO_O_GPACTRL            0x0         // GPIO A Qualification Sampling
                                              // Period Control (GPIO0 to 31)
#define GPIO_O_GPAQSEL1           0x2         // GPIO A Qualifier Select 1
                                              // Register (GPIO0 to 15)
#define GPIO_O_GPAQSEL2           0x4         // GPIO A Qualifier Select 2
                                              // Register (GPIO16 to 31)
#define GPIO_O_GPAMUX1            0x6         // GPIO A Mux 1 Register (GPIO0 to
                                              // 15)
#define GPIO_O_GPAMUX2            0x8         // GPIO A Mux 2 Register (GPIO16
                                              // to 31)
#define GPIO_O_GPADIR             0xA         // GPIO A Direction Register
                                              // (GPIO0 to 31)
#define GPIO_O_GPAPUD             0xC         // GPIO A Pull Up Disable Register
                                              // (GPIO0 to 31)
#define GPIO_O_GPAINV             0x10        // GPIO A Input Polarity Invert
                                              // Registers (GPIO0 to 31)
#define GPIO_O_GPAODR             0x12        // GPIO A Open Drain Output
                                              // Register (GPIO0 to GPIO31)
#define GPIO_O_GPAGMUX1           0x20        // GPIO A Peripheral Group Mux
                                              // (GPIO0 to 15)
#define GPIO_O_GPAGMUX2           0x22        // GPIO A Peripheral Group Mux
                                              // (GPIO16 to 31)
#define GPIO_O_GPACSEL1           0x28        // GPIO A Core Select Register
                                              // (GPIO0 to 7)
#define GPIO_O_GPACSEL2           0x2A        // GPIO A Core Select Register
                                              // (GPIO8 to 15)
#define GPIO_O_GPACSEL3           0x2C        // GPIO A Core Select Register
                                              // (GPIO16 to 23)
#define GPIO_O_GPACSEL4           0x2E        // GPIO A Core Select Register
                                              // (GPIO24 to 31)
#define GPIO_O_GPALOCK            0x3C        // GPIO A Lock Configuration
                                              // Register (GPIO0 to 31)
#define GPIO_O_GPACR              0x3E        // GPIO A Lock Commit Register
                                              // (GPIO0 to 31)
#define GPIO_O_GPBCTRL            0x40        // GPIO B Qualification Sampling
                                              // Period Control (GPIO32 to 63)
#define GPIO_O_GPBQSEL1           0x42        // GPIO B Qualifier Select 1
                                              // Register (GPIO32 to 47)
#define GPIO_O_GPBQSEL2           0x44        // GPIO B Qualifier Select 2
                                              // Register (GPIO48 to 63)
#define GPIO_O_GPBMUX1            0x46        // GPIO B Mux 1 Register (GPIO32
                                              // to 47)
#define GPIO_O_GPBMUX2            0x48        // GPIO B Mux 2 Register (GPIO48
                                              // to 63)
#define GPIO_O_GPBDIR             0x4A        // GPIO B Direction Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPBPUD             0x4C        // GPIO B Pull Up Disable Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPBINV             0x50        // GPIO B Input Polarity Invert
                                              // Registers (GPIO32 to 63)
#define GPIO_O_GPBODR             0x52        // GPIO B Open Drain Output
                                              // Register (GPIO32 to GPIO63)
#define GPIO_O_GPBAMSEL           0x54        // GPIO B Analog Mode Select
                                              // register (GPIO32 to GPIO63)
#define GPIO_O_GPBGMUX1           0x60        // GPIO B Peripheral Group Mux
                                              // (GPIO32 to 47)
#define GPIO_O_GPBGMUX2           0x62        // GPIO B Peripheral Group Mux
                                              // (GPIO48 to 63)
#define GPIO_O_GPBCSEL1           0x68        // GPIO B Core Select Register
                                              // (GPIO32 to 39)
#define GPIO_O_GPBCSEL2           0x6A        // GPIO B Core Select Register
                                              // (GPIO40 to 47)
#define GPIO_O_GPBCSEL3           0x6C        // GPIO B Core Select Register
                                              // (GPIO48 to 55)
#define GPIO_O_GPBCSEL4           0x6E        // GPIO B Core Select Register
                                              // (GPIO56 to 63)
#define GPIO_O_GPBLOCK            0x7C        // GPIO B Lock Configuration
                                              // Register (GPIO32 to 63)
#define GPIO_O_GPBCR              0x7E        // GPIO B Lock Commit Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPCCTRL            0x80        // GPIO C Qualification Sampling
                                              // Period Control (GPIO64 to 95)
#define GPIO_O_GPCQSEL1           0x82        // GPIO C Qualifier Select 1
                                              // Register (GPIO64 to 79)
#define GPIO_O_GPCQSEL2           0x84        // GPIO C Qualifier Select 2
                                              // Register (GPIO80  to 95)
#define GPIO_O_GPCMUX1            0x86        // GPIO C Mux 1 Register (GPIO64
                                              // to 79)
#define GPIO_O_GPCMUX2            0x88        // GPIO C Mux 2 Register (GPIO80 
                                              // to 95)
#define GPIO_O_GPCDIR             0x8A        // GPIO C Direction Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPCPUD             0x8C        // GPIO C Pull Up Disable Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPCINV             0x90        // GPIO C Input Polarity Invert
                                              // Registers (GPIO64 to 95)
#define GPIO_O_GPCODR             0x92        // GPIO C Open Drain Output
                                              // Register (GPIO64 to GPIO95)
#define GPIO_O_GPCGMUX1           0xA0        // GPIO C Peripheral Group Mux
                                              // (GPIO64 to 79)
#define GPIO_O_GPCGMUX2           0xA2        // GPIO C Peripheral Group Mux
                                              // (GPIO80  to 95)
#define GPIO_O_GPCCSEL1           0xA8        // GPIO C Core Select Register
                                              // (GPIO64 to 71)
#define GPIO_O_GPCCSEL2           0xAA        // GPIO C Core Select Register
                                              // (GPIO72 to 79)
#define GPIO_O_GPCCSEL3           0xAC        // GPIO C Core Select Register
                                              // (GPIO80  to 87)
#define GPIO_O_GPCCSEL4           0xAE        // GPIO C Core Select Register
                                              // (GPIO88 to 95)
#define GPIO_O_GPCLOCK            0xBC        // GPIO C Lock Configuration
                                              // Register (GPIO64 to 95)
#define GPIO_O_GPCCR              0xBE        // GPIO C Lock Commit Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPDCTRL            0xC0        // GPIO D Qualification Sampling
                                              // Period Control (GPIO96 to 127)
#define GPIO_O_GPDQSEL1           0xC2        // GPIO D Qualifier Select 1
                                              // Register (GPIO96 to 111)
#define GPIO_O_GPDQSEL2           0xC4        // GPIO D Qualifier Select 2
                                              // Register (GPIO112 to 127)
#define GPIO_O_GPDMUX1            0xC6        // GPIO D Mux 1 Register (GPIO96
                                              // to 111)
#define GPIO_O_GPDMUX2            0xC8        // GPIO D Mux 2 Register (GPIO112
                                              // to 127)
#define GPIO_O_GPDDIR             0xCA        // GPIO D Direction Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPDPUD             0xCC        // GPIO D Pull Up Disable Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPDINV             0xD0        // GPIO D Input Polarity Invert
                                              // Registers (GPIO96 to 127)
#define GPIO_O_GPDODR             0xD2        // GPIO D Open Drain Output
                                              // Register (GPIO96 to GPIO127)
#define GPIO_O_GPDGMUX1           0xE0        // GPIO D Peripheral Group Mux
                                              // (GPIO96 to 111)
#define GPIO_O_GPDGMUX2           0xE2        // GPIO D Peripheral Group Mux
                                              // (GPIO112 to 127)
#define GPIO_O_GPDCSEL1           0xE8        // GPIO D Core Select Register
                                              // (GPIO96 to 103)
#define GPIO_O_GPDCSEL2           0xEA        // GPIO D Core Select Register
                                              // (GPIO104 to 111)
#define GPIO_O_GPDCSEL3           0xEC        // GPIO D Core Select Register
                                              // (GPIO112 to 119)
#define GPIO_O_GPDCSEL4           0xEE        // GPIO D Core Select Register
                                              // (GPIO120 to 127)
#define GPIO_O_GPDLOCK            0xFC        // GPIO D Lock Configuration
                                              // Register (GPIO96 to 127)
#define GPIO_O_GPDCR              0xFE        // GPIO D Lock Commit Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPECTRL            0x100       // GPIO E Qualification Sampling
                                              // Period Control (GPIO128 to
                                              // 159)
#define GPIO_O_GPEQSEL1           0x102       // GPIO E Qualifier Select 1
                                              // Register (GPIO128 to 143)
#define GPIO_O_GPEQSEL2           0x104       // GPIO E Qualifier Select 2
                                              // Register (GPIO144  to 159)
#define GPIO_O_GPEMUX1            0x106       // GPIO E Mux 1 Register (GPIO128
                                              // to 143)
#define GPIO_O_GPEMUX2            0x108       // GPIO E Mux 2 Register (GPIO144 
                                              // to 159)
#define GPIO_O_GPEDIR             0x10A       // GPIO E Direction Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPEPUD             0x10C       // GPIO E Pull Up Disable Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPEINV             0x110       // GPIO E Input Polarity Invert
                                              // Registers (GPIO128 to 159)
#define GPIO_O_GPEODR             0x112       // GPIO E Open Drain Output
                                              // Register (GPIO128 to GPIO159)
#define GPIO_O_GPEGMUX1           0x120       // GPIO E Peripheral Group Mux
                                              // (GPIO128 to 143)
#define GPIO_O_GPEGMUX2           0x122       // GPIO E Peripheral Group Mux
                                              // (GPIO144  to 159)
#define GPIO_O_GPECSEL1           0x128       // GPIO E Core Select Register
                                              // (GPIO128 to 135)
#define GPIO_O_GPECSEL2           0x12A       // GPIO E Core Select Register
                                              // (GPIO136 to 143)
#define GPIO_O_GPECSEL3           0x12C       // GPIO E Core Select Register
                                              // (GPIO144  to 151)
#define GPIO_O_GPECSEL4           0x12E       // GPIO E Core Select Register
                                              // (GPIO152 to 159)
#define GPIO_O_GPELOCK            0x13C       // GPIO E Lock Configuration
                                              // Register (GPIO128 to 159)
#define GPIO_O_GPECR              0x13E       // GPIO E Lock Commit Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPFCTRL            0x140       // GPIO F Qualification Sampling
                                              // Period Control (GPIO160 to
                                              // 168)
#define GPIO_O_GPFQSEL1           0x142       // GPIO F Qualifier Select 1
                                              // Register (GPIO160 to 168)
#define GPIO_O_GPFMUX1            0x146       // GPIO F Mux 1 Register (GPIO160
                                              // to 168)
#define GPIO_O_GPFDIR             0x14A       // GPIO F Direction Register
                                              // (GPIO160 to 168)
#define GPIO_O_GPFPUD             0x14C       // GPIO F Pull Up Disable Register
                                              // (GPIO160 to 168)
#define GPIO_O_GPFINV             0x150       // GPIO F Input Polarity Invert
                                              // Registers (GPIO160 to 168)
#define GPIO_O_GPFODR             0x152       // GPIO F Open Drain Output
                                              // Register (GPIO160 to GPIO168)
#define GPIO_O_GPFGMUX1           0x160       // GPIO F Peripheral Group Mux
                                              // (GPIO160 to 168)
#define GPIO_O_GPFCSEL1           0x168       // GPIO F Core Select Register
                                              // (GPIO160 to 167)
#define GPIO_O_GPFCSEL2           0x16A       // GPIO F Core Select Register
                                              // (GPIO168)
#define GPIO_O_GPFLOCK            0x17C       // GPIO F Lock Configuration
                                              // Register (GPIO160 to 168)
#define GPIO_O_GPFCR              0x17E       // GPIO F Lock Commit Register
                                              // (GPIO160 to 168)
#define GPIO_O_GPADAT             0x0         // GPIO A Data Register (GPIO0 to
                                              // 31)
#define GPIO_O_GPASET             0x2         // GPIO A Data Set Register (GPIO0
                                              // to 31)
#define GPIO_O_GPACLEAR           0x4         // GPIO A Data Clear Register
                                              // (GPIO0 to 31)
#define GPIO_O_GPATOGGLE          0x6         // GPIO A Data Toggle Register
                                              // (GPIO0 to 31)
#define GPIO_O_GPBDAT             0x8         // GPIO B Data Register (GPIO32 to
                                              // 63)
#define GPIO_O_GPBSET             0xA         // GPIO B Data Set Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPBCLEAR           0xC         // GPIO B Data Clear Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPBTOGGLE          0xE         // GPIO B Data Toggle Register
                                              // (GPIO32 to 63)
#define GPIO_O_GPCDAT             0x10        // GPIO C Data Register (GPIO64 to
                                              // 95)
#define GPIO_O_GPCSET             0x12        // GPIO C Data Set Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPCCLEAR           0x14        // GPIO C Data Clear Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPCTOGGLE          0x16        // GPIO C Data Toggle Register
                                              // (GPIO64 to 95)
#define GPIO_O_GPDDAT             0x18        // GPIO D Data Register (GPIO96 to
                                              // 127)
#define GPIO_O_GPDSET             0x1A        // GPIO D Data Set Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPDCLEAR           0x1C        // GPIO D Data Clear Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPDTOGGLE          0x1E        // GPIO D Data Toggle Register
                                              // (GPIO96 to 127)
#define GPIO_O_GPEDAT             0x20        // GPIO E Data Register (GPIO128
                                              // to 159)
#define GPIO_O_GPESET             0x22        // GPIO E Data Set Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPECLEAR           0x24        // GPIO E Data Clear Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPETOGGLE          0x26        // GPIO E Data Toggle Register
                                              // (GPIO128 to 159)
#define GPIO_O_GPFDAT             0x28        // GPIO F Data Register (GPIO160
                                              // to 168)
#define GPIO_O_GPFSET             0x2A        // GPIO F Data Set Register
                                              // (GPIO160 to 168)
#define GPIO_O_GPFCLEAR           0x2C        // GPIO F Data Clear Register
                                              // (GPIO160 to 168)
#define GPIO_O_GPFTOGGLE          0x2E        // GPIO F Data Toggle Register
                                              // (GPIO160 to 168)

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACTRL register
//
//*****************************************************************************
#define GPIO_GPACTRL_QUALPRD0_S   0
#define GPIO_GPACTRL_QUALPRD0_M   0xFF        // Qualification sampling period
                                              // for GPIO0 to GPIO7
#define GPIO_GPACTRL_QUALPRD1_S   8
#define GPIO_GPACTRL_QUALPRD1_M   0xFF00      // Qualification sampling period
                                              // for GPIO8 to GPIO15
#define GPIO_GPACTRL_QUALPRD2_S   16
#define GPIO_GPACTRL_QUALPRD2_M   0xFF0000    // Qualification sampling period
                                              // for GPIO16 to GPIO23
#define GPIO_GPACTRL_QUALPRD3_S   24
#define GPIO_GPACTRL_QUALPRD3_M   0xFF000000  // Qualification sampling period
                                              // for GPIO24 to GPIO31

