jibonaronno/documentsA/ACQ/tms320f28377s_v303 - ACQ Source Code/tms320f28377s_v303/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL4 register
//
//*****************************************************************************
#define GPIO_GPDCSEL4_GPIO120_S   0
#define GPIO_GPDCSEL4_GPIO120_M   0xF         // GPIO120 Master CPU Select
#define GPIO_GPDCSEL4_GPIO121_S   4
#define GPIO_GPDCSEL4_GPIO121_M   0xF0        // GPIO121 Master CPU Select
#define GPIO_GPDCSEL4_GPIO122_S   8
#define GPIO_GPDCSEL4_GPIO122_M   0xF00       // GPIO122 Master CPU Select
#define GPIO_GPDCSEL4_GPIO123_S   12
#define GPIO_GPDCSEL4_GPIO123_M   0xF000      // GPIO123 Master CPU Select
#define GPIO_GPDCSEL4_GPIO124_S   16
#define GPIO_GPDCSEL4_GPIO124_M   0xF0000     // GPIO124 Master CPU Select
#define GPIO_GPDCSEL4_GPIO125_S   20
#define GPIO_GPDCSEL4_GPIO125_M   0xF00000    // GPIO125 Master CPU Select
#define GPIO_GPDCSEL4_GPIO126_S   24
#define GPIO_GPDCSEL4_GPIO126_M   0xF000000   // GPIO126 Master CPU Select
#define GPIO_GPDCSEL4_GPIO127_S   28
#define GPIO_GPDCSEL4_GPIO127_M   0xF0000000  // GPIO127 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDLOCK register
//
//*****************************************************************************
#define GPIO_GPDLOCK_GPIO96       0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO97       0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO98       0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO99       0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO100      0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO101      0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO102      0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO103      0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO104      0x100       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO105      0x200       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO106      0x400       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO107      0x800       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO108      0x1000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO109      0x2000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO110      0x4000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO111      0x8000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO112      0x10000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO113      0x20000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO114      0x40000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO115      0x80000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO116      0x100000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO117      0x200000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO118      0x400000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO119      0x800000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO120      0x1000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO121      0x2000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO122      0x4000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO123      0x8000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO124      0x10000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO125      0x20000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO126      0x40000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPDLOCK_GPIO127      0x80000000  // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCR register
//
//*****************************************************************************
#define GPIO_GPDCR_GPIO96         0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO97         0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO98         0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO99         0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO100        0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO101        0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO102        0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO103        0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO104        0x100       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO105        0x200       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO106        0x400       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO107        0x800       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO108        0x1000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO109        0x2000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO110        0x4000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO111        0x8000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO112        0x10000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO113        0x20000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO114        0x40000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO115        0x80000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO116        0x100000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO117        0x200000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO118        0x400000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO119        0x800000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO120        0x1000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO121        0x2000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO122        0x4000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO123        0x8000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO124        0x10000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO125        0x20000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO126        0x40000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPDCR_GPIO127        0x80000000  // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECTRL register
//
//*****************************************************************************
#define GPIO_GPECTRL_QUALPRD0_S   0
#define GPIO_GPECTRL_QUALPRD0_M   0xFF        // Qualification sampling period
                                              // for GPIO128 to GPIO135
#define GPIO_GPECTRL_QUALPRD1_S   8
#define GPIO_GPECTRL_QUALPRD1_M   0xFF00      // Qualification sampling period
                                              // for GPIO136 to GPIO143
#define GPIO_GPECTRL_QUALPRD2_S   16
#define GPIO_GPECTRL_QUALPRD2_M   0xFF0000    // Qualification sampling period
                                              // for GPIO144 to GPIO151
#define GPIO_GPECTRL_QUALPRD3_S   24
#define GPIO_GPECTRL_QUALPRD3_M   0xFF000000  // Qualification sampling period
                                              // for GPIO152 to GPIO159

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEQSEL1 register
//
//*****************************************************************************
#define GPIO_GPEQSEL1_GPIO128_S   0
#define GPIO_GPEQSEL1_GPIO128_M   0x3         // Select input qualification type
                                              // for GPIO128
#define GPIO_GPEQSEL1_GPIO129_S   2
#define GPIO_GPEQSEL1_GPIO129_M   0xC         // Select input qualification type
                                              // for GPIO129
#define GPIO_GPEQSEL1_GPIO130_S   4
#define GPIO_GPEQSEL1_GPIO130_M   0x30        // Select input qualification type
                                              // for GPIO130
#define GPIO_GPEQSEL1_GPIO131_S   6
#define GPIO_GPEQSEL1_GPIO131_M   0xC0        // Select input qualification type
                                              // for GPIO131
#define GPIO_GPEQSEL1_GPIO132_S   8
#define GPIO_GPEQSEL1_GPIO132_M   0x300       // Select input qualification type
                                              // for GPIO132
#define GPIO_GPEQSEL1_GPIO133_S   10
#define GPIO_GPEQSEL1_GPIO133_M   0xC00       // Select input qualification type
                                              // for GPIO133
#define GPIO_GPEQSEL1_GPIO134_S   12
#define GPIO_GPEQSEL1_GPIO134_M   0x3000      // Select input qualification type
                                              // for GPIO134
#define GPIO_GPEQSEL1_GPIO135_S   14
#define GPIO_GPEQSEL1_GPIO135_M   0xC000      // Select input qualification type
                                              // for GPIO135
#define GPIO_GPEQSEL1_GPIO136_S   16
#define GPIO_GPEQSEL1_GPIO136_M   0x30000     // Select input qualification type
                                              // for GPIO136
#define GPIO_GPEQSEL1_GPIO137_S   18
#define GPIO_GPEQSEL1_GPIO137_M   0xC0000     // Select input qualification type
                                              // for GPIO137
#define GPIO_GPEQSEL1_GPIO138_S   20
#define GPIO_GPEQSEL1_GPIO138_M   0x300000    // Select input qualification type
                                              // for GPIO138
#define GPIO_GPEQSEL1_GPIO139_S   22
#define GPIO_GPEQSEL1_GPIO139_M   0xC00000    // Select input qualification type
                                              // for GPIO139
#define GPIO_GPEQSEL1_GPIO140_S   24
#define GPIO_GPEQSEL1_GPIO140_M   0x3000000   // Select input qualification type
                                              // for GPIO140
#define GPIO_GPEQSEL1_GPIO141_S   26
#define GPIO_GPEQSEL1_GPIO141_M   0xC000000   // Select input qualification type
                                              // for GPIO141
#define GPIO_GPEQSEL1_GPIO142_S   28
#define GPIO_GPEQSEL1_GPIO142_M   0x30000000  // Select input qualification type
                                              // for GPIO142
#define GPIO_GPEQSEL1_GPIO143_S   30
#define GPIO_GPEQSEL1_GPIO143_M   0xC0000000  // Select input qualification type
                                              // for GPIO143

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEQSEL2 register
//
//*****************************************************************************
#define GPIO_GPEQSEL2_GPIO144_S   0
#define GPIO_GPEQSEL2_GPIO144_M   0x3         // Select input qualification type
                                              // for GPIO144
#define GPIO_GPEQSEL2_GPIO145_S   2
#define GPIO_GPEQSEL2_GPIO145_M   0xC         // Select input qualification type
                                              // for GPIO145
#define GPIO_GPEQSEL2_GPIO146_S   4
#define GPIO_GPEQSEL2_GPIO146_M   0x30        // Select input qualification type
                                              // for GPIO146
#define GPIO_GPEQSEL2_GPIO147_S   6
#define GPIO_GPEQSEL2_GPIO147_M   0xC0        // Select input qualification type
                                              // for GPIO147
#define GPIO_GPEQSEL2_GPIO148_S   8
#define GPIO_GPEQSEL2_GPIO148_M   0x300       // Select input qualification type
                                              // for GPIO148
#define GPIO_GPEQSEL2_GPIO149_S   10
#define GPIO_GPEQSEL2_GPIO149_M   0xC00       // Select input qualification type
                                              // for GPIO149
#define GPIO_GPEQSEL2_GPIO150_S   12
#define GPIO_GPEQSEL2_GPIO150_M   0x3000      // Select input qualification type
                                              // for GPIO150
#define GPIO_GPEQSEL2_GPIO151_S   14
#define GPIO_GPEQSEL2_GPIO151_M   0xC000      // Select input qualification type
                                              // for GPIO151
#define GPIO_GPEQSEL2_GPIO152_S   16
#define GPIO_GPEQSEL2_GPIO152_M   0x30000     // Select input qualification type
                                              // for GPIO152
#define GPIO_GPEQSEL2_GPIO153_S   18
#define GPIO_GPEQSEL2_GPIO153_M   0xC0000     // Select input qualification type
                                              // for GPIO153
#define GPIO_GPEQSEL2_GPIO154_S   20
#define GPIO_GPEQSEL2_GPIO154_M   0x300000    // Select input qualification type
                                              // for GPIO154
#define GPIO_GPEQSEL2_GPIO155_S   22
#define GPIO_GPEQSEL2_GPIO155_M   0xC00000    // Select input qualification type
                                              // for GPIO155
#define GPIO_GPEQSEL2_GPIO156_S   24
#define GPIO_GPEQSEL2_GPIO156_M   0x3000000   // Select input qualification type
                                              // for GPIO156
#define GPIO_GPEQSEL2_GPIO157_S   26
#define GPIO_GPEQSEL2_GPIO157_M   0xC000000   // Select input qualification type
                                              // for GPIO157
#define GPIO_GPEQSEL2_GPIO158_S   28
#define GPIO_GPEQSEL2_GPIO158_M   0x30000000  // Select input qualification type
                                              // for GPIO158
#define GPIO_GPEQSEL2_GPIO159_S   30
#define GPIO_GPEQSEL2_GPIO159_M   0xC0000000  // Select input qualification type
                                              // for GPIO159

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEMUX1 register
//
//*****************************************************************************
#define GPIO_GPEMUX1_GPIO128_S    0
#define GPIO_GPEMUX1_GPIO128_M    0x3         // Defines pin-muxing selection
                                              // for GPIO128
#define GPIO_GPEMUX1_GPIO129_S    2
#define GPIO_GPEMUX1_GPIO129_M    0xC         // Defines pin-muxing selection
                                              // for GPIO129
#define GPIO_GPEMUX1_GPIO130_S    4
#define GPIO_GPEMUX1_GPIO130_M    0x30        // Defines pin-muxing selection
                                              // for GPIO130
#define GPIO_GPEMUX1_GPIO131_S    6
#define GPIO_GPEMUX1_GPIO131_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO131
#define GPIO_GPEMUX1_GPIO132_S    8
#define GPIO_GPEMUX1_GPIO132_M    0x300       // Defines pin-muxing selection
                                              // for GPIO132
#define GPIO_GPEMUX1_GPIO133_S    10
#define GPIO_GPEMUX1_GPIO133_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO133
#define GPIO_GPEMUX1_GPIO134_S    12
#define GPIO_GPEMUX1_GPIO134_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO134
#define GPIO_GPEMUX1_GPIO135_S    14
#define GPIO_GPEMUX1_GPIO135_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO135
#define GPIO_GPEMUX1_GPIO136_S    16
#define GPIO_GPEMUX1_GPIO136_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO136
#define GPIO_GPEMUX1_GPIO137_S    18
#define GPIO_GPEMUX1_GPIO137_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO137
#define GPIO_GPEMUX1_GPIO138_S    20
#define GPIO_GPEMUX1_GPIO138_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO138
#define GPIO_GPEMUX1_GPIO139_S    22
#define GPIO_GPEMUX1_GPIO139_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO139
#define GPIO_GPEMUX1_GPIO140_S    24
#define GPIO_GPEMUX1_GPIO140_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO140
#define GPIO_GPEMUX1_GPIO141_S    26
#define GPIO_GPEMUX1_GPIO141_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO141
#define GPIO_GPEMUX1_GPIO142_S    28
#define GPIO_GPEMUX1_GPIO142_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO142
#define GPIO_GPEMUX1_GPIO143_S    30
#define GPIO_GPEMUX1_GPIO143_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO143

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEMUX2 register
//
//*****************************************************************************
#define GPIO_GPEMUX2_GPIO144_S    0
#define GPIO_GPEMUX2_GPIO144_M    0x3         // Defines pin-muxing selection
                                              // for GPIO144
#define GPIO_GPEMUX2_GPIO145_S    2
#define GPIO_GPEMUX2_GPIO145_M    0xC         // Defines pin-muxing selection
                                              // for GPIO145
#define GPIO_GPEMUX2_GPIO146_S    4
#define GPIO_GPEMUX2_GPIO146_M    0x30        // Defines pin-muxing selection
                                              // for GPIO146
#define GPIO_GPEMUX2_GPIO147_S    6
#define GPIO_GPEMUX2_GPIO147_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO147
#define GPIO_GPEMUX2_GPIO148_S    8
#define GPIO_GPEMUX2_GPIO148_M    0x300       // Defines pin-muxing selection
                                              // for GPIO148
#define GPIO_GPEMUX2_GPIO149_S    10
#define GPIO_GPEMUX2_GPIO149_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO149
#define GPIO_GPEMUX2_GPIO150_S    12
#define GPIO_GPEMUX2_GPIO150_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO150
#define GPIO_GPEMUX2_GPIO151_S    14
#define GPIO_GPEMUX2_GPIO151_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO151
#define GPIO_GPEMUX2_GPIO152_S    16
#define GPIO_GPEMUX2_GPIO152_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO152
#define GPIO_GPEMUX2_GPIO153_S    18
#define GPIO_GPEMUX2_GPIO153_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO153
#define GPIO_GPEMUX2_GPIO154_S    20
#define GPIO_GPEMUX2_GPIO154_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO154
#define GPIO_GPEMUX2_GPIO155_S    22
#define GPIO_GPEMUX2_GPIO155_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO155
#define GPIO_GPEMUX2_GPIO156_S    24
#define GPIO_GPEMUX2_GPIO156_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO156
#define GPIO_GPEMUX2_GPIO157_S    26
#define GPIO_GPEMUX2_GPIO157_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO157
#define GPIO_GPEMUX2_GPIO158_S    28
#define GPIO_GPEMUX2_GPIO158_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO158
#define GPIO_GPEMUX2_GPIO159_S    30
#define GPIO_GPEMUX2_GPIO159_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO159

