jibonaronno/documentsA/ACQ/tms320f28377s_v303 - ACQ Source Code/tms320f28377s_v303/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPFPUD register
//
//*****************************************************************************
#define GPIO_GPFPUD_GPIO160       0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO161       0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO162       0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO163       0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO164       0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO165       0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO166       0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO167       0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO168       0x100       // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFINV register
//
//*****************************************************************************
#define GPIO_GPFINV_GPIO160       0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO161       0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO162       0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO163       0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO164       0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO165       0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO166       0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO167       0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO168       0x100       // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFODR register
//
//*****************************************************************************
#define GPIO_GPFODR_GPIO160       0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO161       0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO162       0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO163       0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO164       0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO165       0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO166       0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO167       0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO168       0x100       // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX1 register
//
//*****************************************************************************
#define GPIO_GPFGMUX1_GPIO160_S   0
#define GPIO_GPFGMUX1_GPIO160_M   0x3         // Defines pin-muxing selection
                                              // for GPIO160
#define GPIO_GPFGMUX1_GPIO161_S   2
#define GPIO_GPFGMUX1_GPIO161_M   0xC         // Defines pin-muxing selection
                                              // for GPIO161
#define GPIO_GPFGMUX1_GPIO162_S   4
#define GPIO_GPFGMUX1_GPIO162_M   0x30        // Defines pin-muxing selection
                                              // for GPIO162
#define GPIO_GPFGMUX1_GPIO163_S   6
#define GPIO_GPFGMUX1_GPIO163_M   0xC0        // Defines pin-muxing selection
                                              // for GPIO163
#define GPIO_GPFGMUX1_GPIO164_S   8
#define GPIO_GPFGMUX1_GPIO164_M   0x300       // Defines pin-muxing selection
                                              // for GPIO164
#define GPIO_GPFGMUX1_GPIO165_S   10
#define GPIO_GPFGMUX1_GPIO165_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO165
#define GPIO_GPFGMUX1_GPIO166_S   12
#define GPIO_GPFGMUX1_GPIO166_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO166
#define GPIO_GPFGMUX1_GPIO167_S   14
#define GPIO_GPFGMUX1_GPIO167_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO167
#define GPIO_GPFGMUX1_GPIO168_S   16
#define GPIO_GPFGMUX1_GPIO168_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL1 register
//
//*****************************************************************************
#define GPIO_GPFCSEL1_GPIO160_S   0
#define GPIO_GPFCSEL1_GPIO160_M   0xF         // GPIO160 Master CPU Select
#define GPIO_GPFCSEL1_GPIO161_S   4
#define GPIO_GPFCSEL1_GPIO161_M   0xF0        // GPIO161 Master CPU Select
#define GPIO_GPFCSEL1_GPIO162_S   8
#define GPIO_GPFCSEL1_GPIO162_M   0xF00       // GPIO162 Master CPU Select
#define GPIO_GPFCSEL1_GPIO163_S   12
#define GPIO_GPFCSEL1_GPIO163_M   0xF000      // GPIO163 Master CPU Select
#define GPIO_GPFCSEL1_GPIO164_S   16
#define GPIO_GPFCSEL1_GPIO164_M   0xF0000     // GPIO164 Master CPU Select
#define GPIO_GPFCSEL1_GPIO165_S   20
#define GPIO_GPFCSEL1_GPIO165_M   0xF00000    // GPIO165 Master CPU Select
#define GPIO_GPFCSEL1_GPIO166_S   24
#define GPIO_GPFCSEL1_GPIO166_M   0xF000000   // GPIO166 Master CPU Select
#define GPIO_GPFCSEL1_GPIO167_S   28
#define GPIO_GPFCSEL1_GPIO167_M   0xF0000000  // GPIO167 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL2 register
//
//*****************************************************************************
#define GPIO_GPFCSEL2_GPIO168_S   0
#define GPIO_GPFCSEL2_GPIO168_M   0xF         // GPIO168 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFLOCK register
//
//*****************************************************************************
#define GPIO_GPFLOCK_GPIO160      0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO161      0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO162      0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO163      0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO164      0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO165      0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO166      0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO167      0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO168      0x100       // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCR register
//
//*****************************************************************************
#define GPIO_GPFCR_GPIO160        0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO161        0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO162        0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO163        0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO164        0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO165        0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO166        0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO167        0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO168        0x100       // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPADAT register
//
//*****************************************************************************
#define GPIO_GPADAT_GPIO0         0x1         // Data Register for this pin
#define GPIO_GPADAT_GPIO1         0x2         // Data Register for this pin
#define GPIO_GPADAT_GPIO2         0x4         // Data Register for this pin
#define GPIO_GPADAT_GPIO3         0x8         // Data Register for this pin
#define GPIO_GPADAT_GPIO4         0x10        // Data Register for this pin
#define GPIO_GPADAT_GPIO5         0x20        // Data Register for this pin
#define GPIO_GPADAT_GPIO6         0x40        // Data Register for this pin
#define GPIO_GPADAT_GPIO7         0x80        // Data Register for this pin
#define GPIO_GPADAT_GPIO8         0x100       // Data Register for this pin
#define GPIO_GPADAT_GPIO9         0x200       // Data Register for this pin
#define GPIO_GPADAT_GPIO10        0x400       // Data Register for this pin
#define GPIO_GPADAT_GPIO11        0x800       // Data Register for this pin
#define GPIO_GPADAT_GPIO12        0x1000      // Data Register for this pin
#define GPIO_GPADAT_GPIO13        0x2000      // Data Register for this pin
#define GPIO_GPADAT_GPIO14        0x4000      // Data Register for this pin
#define GPIO_GPADAT_GPIO15        0x8000      // Data Register for this pin
#define GPIO_GPADAT_GPIO16        0x10000     // Data Register for this pin
#define GPIO_GPADAT_GPIO17        0x20000     // Data Register for this pin
#define GPIO_GPADAT_GPIO18        0x40000     // Data Register for this pin
#define GPIO_GPADAT_GPIO19        0x80000     // Data Register for this pin
#define GPIO_GPADAT_GPIO20        0x100000    // Data Register for this pin
#define GPIO_GPADAT_GPIO21        0x200000    // Data Register for this pin
#define GPIO_GPADAT_GPIO22        0x400000    // Data Register for this pin
#define GPIO_GPADAT_GPIO23        0x800000    // Data Register for this pin
#define GPIO_GPADAT_GPIO24        0x1000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO25        0x2000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO26        0x4000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO27        0x8000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO28        0x10000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO29        0x20000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO30        0x40000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO31        0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPASET register
//
//*****************************************************************************
#define GPIO_GPASET_GPIO0         0x1         // Output Set bit for this pin
#define GPIO_GPASET_GPIO1         0x2         // Output Set bit for this pin
#define GPIO_GPASET_GPIO2         0x4         // Output Set bit for this pin
#define GPIO_GPASET_GPIO3         0x8         // Output Set bit for this pin
#define GPIO_GPASET_GPIO4         0x10        // Output Set bit for this pin
#define GPIO_GPASET_GPIO5         0x20        // Output Set bit for this pin
#define GPIO_GPASET_GPIO6         0x40        // Output Set bit for this pin
#define GPIO_GPASET_GPIO7         0x80        // Output Set bit for this pin
#define GPIO_GPASET_GPIO8         0x100       // Output Set bit for this pin
#define GPIO_GPASET_GPIO9         0x200       // Output Set bit for this pin
#define GPIO_GPASET_GPIO10        0x400       // Output Set bit for this pin
#define GPIO_GPASET_GPIO11        0x800       // Output Set bit for this pin
#define GPIO_GPASET_GPIO12        0x1000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO13        0x2000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO14        0x4000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO15        0x8000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO16        0x10000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO17        0x20000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO18        0x40000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO19        0x80000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO20        0x100000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO21        0x200000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO22        0x400000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO23        0x800000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO24        0x1000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO25        0x2000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO26        0x4000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO27        0x8000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO28        0x10000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO29        0x20000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO30        0x40000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO31        0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACLEAR register
//
//*****************************************************************************
#define GPIO_GPACLEAR_GPIO0       0x1         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO1       0x2         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO2       0x4         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO3       0x8         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO4       0x10        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO5       0x20        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO6       0x40        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO7       0x80        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO8       0x100       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO9       0x200       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO10      0x400       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO11      0x800       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO12      0x1000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO13      0x2000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO14      0x4000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO15      0x8000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO16      0x10000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO17      0x20000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO18      0x40000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO19      0x80000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO20      0x100000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO21      0x200000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO22      0x400000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO23      0x800000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO24      0x1000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO25      0x2000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO26      0x4000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO27      0x8000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO28      0x10000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO29      0x20000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO30      0x40000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO31      0x80000000  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPATOGGLE register
//
//*****************************************************************************
#define GPIO_GPATOGGLE_GPIO0      0x1         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO1      0x2         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO2      0x4         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO3      0x8         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO4      0x10        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO5      0x20        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO6      0x40        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO7      0x80        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO8      0x100       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO9      0x200       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO10     0x400       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO11     0x800       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO12     0x1000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO13     0x2000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO14     0x4000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO15     0x8000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO16     0x10000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO17     0x20000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO18     0x40000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO19     0x80000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO20     0x100000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO21     0x200000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO22     0x400000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO23     0x800000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO24     0x1000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO25     0x2000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO26     0x4000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO27     0x8000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO28     0x10000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO29     0x20000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO30     0x40000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO31     0x80000000  // Output Toggle bit for this pin

