jibonaronno/documentsA/ACQ/tms320f28377s_v303 - ACQ Source Code/tms320f28377s_v303/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPDDAT register
//
//*****************************************************************************
#define GPIO_GPDDAT_GPIO96        0x1         // Data Register for this pin
#define GPIO_GPDDAT_GPIO97        0x2         // Data Register for this pin
#define GPIO_GPDDAT_GPIO98        0x4         // Data Register for this pin
#define GPIO_GPDDAT_GPIO99        0x8         // Data Register for this pin
#define GPIO_GPDDAT_GPIO100       0x10        // Data Register for this pin
#define GPIO_GPDDAT_GPIO101       0x20        // Data Register for this pin
#define GPIO_GPDDAT_GPIO102       0x40        // Data Register for this pin
#define GPIO_GPDDAT_GPIO103       0x80        // Data Register for this pin
#define GPIO_GPDDAT_GPIO104       0x100       // Data Register for this pin
#define GPIO_GPDDAT_GPIO105       0x200       // Data Register for this pin
#define GPIO_GPDDAT_GPIO106       0x400       // Data Register for this pin
#define GPIO_GPDDAT_GPIO107       0x800       // Data Register for this pin
#define GPIO_GPDDAT_GPIO108       0x1000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO109       0x2000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO110       0x4000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO111       0x8000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO112       0x10000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO113       0x20000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO114       0x40000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO115       0x80000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO116       0x100000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO117       0x200000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO118       0x400000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO119       0x800000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO120       0x1000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO121       0x2000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO122       0x4000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO123       0x8000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO124       0x10000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO125       0x20000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO126       0x40000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO127       0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDSET register
//
//*****************************************************************************
#define GPIO_GPDSET_GPIO96        0x1         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO97        0x2         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO98        0x4         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO99        0x8         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO100       0x10        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO101       0x20        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO102       0x40        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO103       0x80        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO104       0x100       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO105       0x200       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO106       0x400       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO107       0x800       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO108       0x1000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO109       0x2000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO110       0x4000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO111       0x8000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO112       0x10000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO113       0x20000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO114       0x40000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO115       0x80000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO116       0x100000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO117       0x200000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO118       0x400000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO119       0x800000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO120       0x1000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO121       0x2000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO122       0x4000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO123       0x8000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO124       0x10000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO125       0x20000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO126       0x40000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO127       0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCLEAR register
//
//*****************************************************************************
#define GPIO_GPDCLEAR_GPIO96      0x1         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO97      0x2         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO98      0x4         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO99      0x8         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO100     0x10        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO101     0x20        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO102     0x40        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO103     0x80        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO104     0x100       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO105     0x200       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO106     0x400       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO107     0x800       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO108     0x1000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO109     0x2000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO110     0x4000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO111     0x8000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO112     0x10000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO113     0x20000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO114     0x40000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO115     0x80000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO116     0x100000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO117     0x200000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO118     0x400000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO119     0x800000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO120     0x1000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO121     0x2000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO122     0x4000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO123     0x8000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO124     0x10000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO125     0x20000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO126     0x40000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO127     0x80000000  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDTOGGLE register
//
//*****************************************************************************
#define GPIO_GPDTOGGLE_GPIO96     0x1         // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO97     0x2         // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO98     0x4         // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO99     0x8         // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO100    0x10        // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO101    0x20        // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO102    0x40        // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO103    0x80        // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO104    0x100       // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO105    0x200       // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO106    0x400       // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO107    0x800       // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO108    0x1000      // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO109    0x2000      // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO110    0x4000      // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO111    0x8000      // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO112    0x10000     // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO113    0x20000     // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO114    0x40000     // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO115    0x80000     // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO116    0x100000    // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO117    0x200000    // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO118    0x400000    // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO119    0x800000    // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO120    0x1000000   // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO121    0x2000000   // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO122    0x4000000   // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO123    0x8000000   // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO124    0x10000000  // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO125    0x20000000  // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO126    0x40000000  // Output Toggle bit for this pin
#define GPIO_GPDTOGGLE_GPIO127    0x80000000  // Output Toggle bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEDAT register
//
//*****************************************************************************
#define GPIO_GPEDAT_GPIO128       0x1         // Data Register for this pin
#define GPIO_GPEDAT_GPIO129       0x2         // Data Register for this pin
#define GPIO_GPEDAT_GPIO130       0x4         // Data Register for this pin
#define GPIO_GPEDAT_GPIO131       0x8         // Data Register for this pin
#define GPIO_GPEDAT_GPIO132       0x10        // Data Register for this pin
#define GPIO_GPEDAT_GPIO133       0x20        // Data Register for this pin
#define GPIO_GPEDAT_GPIO134       0x40        // Data Register for this pin
#define GPIO_GPEDAT_GPIO135       0x80        // Data Register for this pin
#define GPIO_GPEDAT_GPIO136       0x100       // Data Register for this pin
#define GPIO_GPEDAT_GPIO137       0x200       // Data Register for this pin
#define GPIO_GPEDAT_GPIO138       0x400       // Data Register for this pin
#define GPIO_GPEDAT_GPIO139       0x800       // Data Register for this pin
#define GPIO_GPEDAT_GPIO140       0x1000      // Data Register for this pin
#define GPIO_GPEDAT_GPIO141       0x2000      // Data Register for this pin
#define GPIO_GPEDAT_GPIO142       0x4000      // Data Register for this pin
#define GPIO_GPEDAT_GPIO143       0x8000      // Data Register for this pin
#define GPIO_GPEDAT_GPIO144       0x10000     // Data Register for this pin
#define GPIO_GPEDAT_GPIO145       0x20000     // Data Register for this pin
#define GPIO_GPEDAT_GPIO146       0x40000     // Data Register for this pin
#define GPIO_GPEDAT_GPIO147       0x80000     // Data Register for this pin
#define GPIO_GPEDAT_GPIO148       0x100000    // Data Register for this pin
#define GPIO_GPEDAT_GPIO149       0x200000    // Data Register for this pin
#define GPIO_GPEDAT_GPIO150       0x400000    // Data Register for this pin
#define GPIO_GPEDAT_GPIO151       0x800000    // Data Register for this pin
#define GPIO_GPEDAT_GPIO152       0x1000000   // Data Register for this pin
#define GPIO_GPEDAT_GPIO153       0x2000000   // Data Register for this pin
#define GPIO_GPEDAT_GPIO154       0x4000000   // Data Register for this pin
#define GPIO_GPEDAT_GPIO155       0x8000000   // Data Register for this pin
#define GPIO_GPEDAT_GPIO156       0x10000000  // Data Register for this pin
#define GPIO_GPEDAT_GPIO157       0x20000000  // Data Register for this pin
#define GPIO_GPEDAT_GPIO158       0x40000000  // Data Register for this pin
#define GPIO_GPEDAT_GPIO159       0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPESET register
//
//*****************************************************************************
#define GPIO_GPESET_GPIO128       0x1         // Output Set bit for this pin
#define GPIO_GPESET_GPIO129       0x2         // Output Set bit for this pin
#define GPIO_GPESET_GPIO130       0x4         // Output Set bit for this pin
#define GPIO_GPESET_GPIO131       0x8         // Output Set bit for this pin
#define GPIO_GPESET_GPIO132       0x10        // Output Set bit for this pin
#define GPIO_GPESET_GPIO133       0x20        // Output Set bit for this pin
#define GPIO_GPESET_GPIO134       0x40        // Output Set bit for this pin
#define GPIO_GPESET_GPIO135       0x80        // Output Set bit for this pin
#define GPIO_GPESET_GPIO136       0x100       // Output Set bit for this pin
#define GPIO_GPESET_GPIO137       0x200       // Output Set bit for this pin
#define GPIO_GPESET_GPIO138       0x400       // Output Set bit for this pin
#define GPIO_GPESET_GPIO139       0x800       // Output Set bit for this pin
#define GPIO_GPESET_GPIO140       0x1000      // Output Set bit for this pin
#define GPIO_GPESET_GPIO141       0x2000      // Output Set bit for this pin
#define GPIO_GPESET_GPIO142       0x4000      // Output Set bit for this pin
#define GPIO_GPESET_GPIO143       0x8000      // Output Set bit for this pin
#define GPIO_GPESET_GPIO144       0x10000     // Output Set bit for this pin
#define GPIO_GPESET_GPIO145       0x20000     // Output Set bit for this pin
#define GPIO_GPESET_GPIO146       0x40000     // Output Set bit for this pin
#define GPIO_GPESET_GPIO147       0x80000     // Output Set bit for this pin
#define GPIO_GPESET_GPIO148       0x100000    // Output Set bit for this pin
#define GPIO_GPESET_GPIO149       0x200000    // Output Set bit for this pin
#define GPIO_GPESET_GPIO150       0x400000    // Output Set bit for this pin
#define GPIO_GPESET_GPIO151       0x800000    // Output Set bit for this pin
#define GPIO_GPESET_GPIO152       0x1000000   // Output Set bit for this pin
#define GPIO_GPESET_GPIO153       0x2000000   // Output Set bit for this pin
#define GPIO_GPESET_GPIO154       0x4000000   // Output Set bit for this pin
#define GPIO_GPESET_GPIO155       0x8000000   // Output Set bit for this pin
#define GPIO_GPESET_GPIO156       0x10000000  // Output Set bit for this pin
#define GPIO_GPESET_GPIO157       0x20000000  // Output Set bit for this pin
#define GPIO_GPESET_GPIO158       0x40000000  // Output Set bit for this pin
#define GPIO_GPESET_GPIO159       0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECLEAR register
//
//*****************************************************************************
#define GPIO_GPECLEAR_GPIO128     0x1         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO129     0x2         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO130     0x4         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO131     0x8         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO132     0x10        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO133     0x20        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO134     0x40        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO135     0x80        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO136     0x100       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO137     0x200       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO138     0x400       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO139     0x800       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO140     0x1000      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO141     0x2000      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO142     0x4000      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO143     0x8000      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO144     0x10000     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO145     0x20000     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO146     0x40000     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO147     0x80000     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO148     0x100000    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO149     0x200000    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO150     0x400000    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO151     0x800000    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO152     0x1000000   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO153     0x2000000   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO154     0x4000000   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO155     0x8000000   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO156     0x10000000  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO157     0x20000000  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO158     0x40000000  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO159     0x80000000  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPETOGGLE register
//
//*****************************************************************************
#define GPIO_GPETOGGLE_GPIO128    0x1         // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO129    0x2         // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO130    0x4         // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO131    0x8         // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO132    0x10        // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO133    0x20        // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO134    0x40        // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO135    0x80        // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO136    0x100       // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO137    0x200       // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO138    0x400       // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO139    0x800       // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO140    0x1000      // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO141    0x2000      // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO142    0x4000      // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO143    0x8000      // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO144    0x10000     // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO145    0x20000     // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO146    0x40000     // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO147    0x80000     // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO148    0x100000    // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO149    0x200000    // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO150    0x400000    // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO151    0x800000    // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO152    0x1000000   // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO153    0x2000000   // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO154    0x4000000   // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO155    0x8000000   // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO156    0x10000000  // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO157    0x20000000  // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO158    0x40000000  // Output Toggle bit for this pin
#define GPIO_GPETOGGLE_GPIO159    0x80000000  // Output Toggle bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFDAT register
//
//*****************************************************************************
#define GPIO_GPFDAT_GPIO160       0x1         // Data Register for this pin
#define GPIO_GPFDAT_GPIO161       0x2         // Data Register for this pin
#define GPIO_GPFDAT_GPIO162       0x4         // Data Register for this pin
#define GPIO_GPFDAT_GPIO163       0x8         // Data Register for this pin
#define GPIO_GPFDAT_GPIO164       0x10        // Data Register for this pin
#define GPIO_GPFDAT_GPIO165       0x20        // Data Register for this pin
#define GPIO_GPFDAT_GPIO166       0x40        // Data Register for this pin
#define GPIO_GPFDAT_GPIO167       0x80        // Data Register for this pin
#define GPIO_GPFDAT_GPIO168       0x100       // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFSET register
//
//*****************************************************************************
#define GPIO_GPFSET_GPIO160       0x1         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO161       0x2         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO162       0x4         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO163       0x8         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO164       0x10        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO165       0x20        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO166       0x40        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO167       0x80        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO168       0x100       // Output Set bit for this pin

